---
type: LinkOperations
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# LinkOperations

`Autodesk.Revit.DB.LinkOperations` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | SetOnLocalLinkSharedCoordinatesSavedCallback | 2018 | `public void SetOnLocalLinkSharedCoordinatesSavedCallback ( IOnLocalLinkSharedCoordinatesSavedCallback onLocalLinkSharedCoordinatesSaved )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |